{
  "type": "doc",
  "content": [
    {
      "type": "paragraph",
      "content": [
        {
          "type": "text",
          "text": "Arenya adjusted her blouse for the fourth time that morning, smoothing down the same crease on her sleeve like it was a code she could break if she stared hard enough. Her email had been irritatingly vague—Teddy wants to see you in his office. ASAP. No subject line. No emoji. That was never a good sign."
        }
      ]
    },
    {
      "type": "paragraph",
      "content": [
        {
          "type": "text",
          "text": "She crossed the newsroom floor with the determined gait of someone who’d made peace with whatever came next—except she hadn’t. Not really. The last time Teddy called her in “ASAP,” it was to tell her that she misspelled “Corgi” in a tweet that had gone viral. They’d trended for two hours as #Korgis. He thought it was genius. She had considered quitting."
        }
      ]
    },
    {
      "type": "paragraph",
      "content": [
        {
          "type": "text",
          "text": "“Teddy’ll see you now,” said Marla, the office manager, who always sounded like she was delivering news of a mild death."
        }
      ]
    },
    {
      "type": "horizontalRule"
    },
    {
      "type": "paragraph",
      "content": [
        {
          "type": "text",
          "text": "Arenya inhaled like she was diving underwater and stepped through the glass door into Teddy’s domain."
        }
      ]
    },
    {
      "type": "paragraph",
      "content": [
        {
          "type": "text",
          "text": "“Renny!” Teddy boomed, arms spread wide like he was introducing her to an invisible audience. He called her Renny, like they were old camp friends. No one else did. She barely tolerated it."
        }
      ]
    },
    {
      "type": "paragraph",
      "content": [
        {
          "type": "text",
          "text": "“You’re not in trouble,” he said, pointing both finger guns at her. “In fact—big news. Huge. Monumental.”"
        }
      ]
    },
    {
      "type": "paragraph",
      "content": [
        {
          "type": "text",
          "text": "She blinked, suspicious. “Okay…”"
        }
      ]
    },
    {
      "type": "paragraph",
      "content": [
        {
          "type": "text",
          "text": "“That article you did on the best dog breeds to own in 2025? It’s officially the third most liked post in the company’s history.” He paused for dramatic effect. “Third. Place. Glory.”"
        }
      ]
    },
    {
      "type": "paragraph",
      "content": [
        {
          "type": "text",
          "text": "He waited, eyebrows wiggling, clearly expecting a reaction. Fireworks. A squeal. Maybe tears."
        }
      ]
    },
    {
      "type": "paragraph",
      "content": [
        {
          "type": "text",
          "text": "“Wow,” Arenya said flatly. “Bronze medal.”"
        }
      ]
    },
    {
      "type": "paragraph",
      "content": [
        {
          "type": "text",
          "text": "“That’s the spirit!” he grinned, entirely missing her tone. “Marketing’s already asking if you can do a follow-up. Maybe ‘Worst Cats for Introverts’? Or like, ‘Top Five Ferrets That Changed the World.’ Something with heart. And paws.”"
        }
      ]
    },
    {
      "type": "paragraph",
      "content": [
        {
          "type": "text",
          "text": "She forced a smile. “I’ll think about it.”"
        }
      ]
    },
    {
      "type": "horizontalRule"
    },
    {
      "type": "paragraph",
      "content": [
        {
          "type": "text",
          "text": "He leaned back in his chair, laced his fingers behind his head. “Kid, you’ve got range. I always say—you can write about dogs, you can write about anything.”"
        }
      ]
    },
    {
      "type": "paragraph",
      "content": [
        {
          "type": "text",
          "text": "Arenya nodded, because that’s what you did when someone gave you a compliment shaped like a cage."
        }
      ]
    },
    {
      "type": "paragraph",
      "content": [
        {
          "type": "text",
          "text": "The door shut behind her with a soft click, and the applause in Teddy’s head probably continued without her."
        }
      ]
    },
    {
      "type": "paragraph",
      "content": [
        {
          "type": "text",
          "text": "Back at her desk, the open tab of her dog breeds article stared back at her. Eight hundred words of algorithm-approved optimism. Labrador, Golden Retriever, Bernese Mountain Dog. All safe bets. All SEO gold. She’d written the whole thing in forty minutes with a latte in hand and a spreadsheet of trending keywords."
        }
      ]
    },
    {
      "type": "horizontalRule"
    },
    {
      "type": "paragraph",
      "content": [
        {
          "type": "text",
          "text": "It wasn’t what she got into journalism for."
        }
      ]
    },
    {
      "type": "paragraph",
      "content": [
        {
          "type": "text",
          "text": "She’d wanted to unravel conspiracies. To chase shadows through dark alleys and bad coffee shops. To find the cracks in the world where truth leaked out. But instead, here she was: thirty clicks away from going viral for ranking poodles."
        }
      ]
    },
    {
      "type": "paragraph",
      "content": [
        {
          "type": "text",
          "text": "She minimized the tab. Opened a blank document."
        }
      ]
    },
    {
      "type": "paragraph",
      "content": [
        {
          "type": "text",
          "text": "And typed:"
        }
      ]
    },
    {
      "type": "paragraph",
      "content": [
        {
          "type": "text",
          "text": "“There is always something beneath the surface. Always.”"
        }
      ]
    },
    {
      "type": "paragraph",
      "content": [
        {
          "type": "text",
          "text": "Maybe it was just a note to herself."
        }
      ]
    },
    {
      "type": "paragraph",
      "content": [
        {
          "type": "text",
          "text": "Or maybe it was the start of something else."
        }
      ]
    },
    {
      "type": "horizontalRule"
    },
    {
      "type": "paragraph",
      "content": [
        {
          "type": "text",
          "text": "The bus ride home was its usual flavor of existential dread: standing-room only, a symphony of notification pings, and someone in the back talking way too loudly about crypto in 2025 like it was still a frontier."
        }
      ]
    },
    {
      "type": "paragraph",
      "content": [
        {
          "type": "text",
          "text": "Arenya stood wedged between a woman in Lululemon with a laptop open to a funding pitch and a guy who smelled like startup burnout. She stared out the window at the familiar blur of San Francisco: glossy buildings rising like promises, streets paved with dreams and overpriced matcha."
        }
      ]
    },
    {
      "type": "paragraph",
      "content": [
        {
          "type": "text",
          "text": "When she stepped into her studio apartment in the Mission, the silence greeted her like an old friend. Or maybe a judgmental aunt. The place was tidy, not because she was particularly clean, but because she was rarely home long enough to make a mess. A bookshelf lined one wall—half investigative memoirs, half fantasy novels with cracked spines and dragons on the covers. A single dying pothos drooped from a macramé hanger she bought during a burst of pandemic optimism."
        }
      ]
    },
    {
      "type": "horizontalRule"
    },
    {
      "type": "paragraph",
      "content": [
        {
          "type": "text",
          "text": "Her phone buzzed on cue. Group chat."
        }
      ]
    },
    {
      "type": "paragraph",
      "content": [
        {
          "type": "text",
          "text": "“Fatima got engaged!!!”"
        }
      ]
    },
    {
      "type": "paragraph",
      "content": [
        {
          "type": "text",
          "text": "“Look at the ring omg”"
        }
      ]
    },
    {
      "type": "paragraph",
      "content": [
        {
          "type": "text",
          "text": "“Fourth one this month lmao what’s in the water??”"
        }
      ]
    },
    {
      "type": "paragraph",
      "content": [
        {
          "type": "text",
          "text": "Arenya stared at the photo of Fatima smiling next to a guy in a Patagonia vest, holding up a modest but expensive-looking ring with the kind of nonchalance that always screamed: I have it together. Fatima worked at a health tech startup that just got Series B funding. Her LinkedIn made it sound like she cured cancer with every sprint cycle."
        }
      ]
    },
    {
      "type": "horizontalRule"
    },
    {
      "type": "paragraph",
      "content": [
        {
          "type": "text",
          "text": "Arenya put the phone face down."
        }
      ]
    },
    {
      "type": "paragraph",
      "content": [
        {
          "type": "text",
          "text": "Sometimes it felt like everyone she knew was on a conveyor belt moving just a little faster than hers—better jobs, bigger apartments, relationships with people who wanted things like joint checking accounts and electric car leases."
        }
      ]
    },
    {
      "type": "paragraph",
      "content": [
        {
          "type": "text",
          "text": "And here she was: master of dog-breed listicles, drinking grocery store wine out of a mug that said “Investigative Badass,” a joke gift from Saiesh that she secretly kind of loved."
        }
      ]
    },
    {
      "type": "paragraph",
      "content": [
        {
          "type": "text",
          "text": "She buzzed him up ten minutes later without even checking if it was him. He always brought snacks."
        }
      ]
    },
    {
      "type": "paragraph",
      "content": [
        {
          "type": "text",
          "text": "“Yo,” Saiesh said as he came in, kicking off his sandals and immediately flopping onto her floor like a starfish. His hoodie read 404: Motivation Not Found."
        }
      ]
    },
    {
      "type": "paragraph",
      "content": [
        {
          "type": "text",
          "text": "He smelled like weed and lemon Pledge—an oddly comforting combination."
        }
      ]
    },
    {
      "type": "paragraph",
      "content": [
        {
          "type": "text",
          "text": "“You eat?” he asked."
        }
      ]
    },
    {
      "type": "paragraph",
      "content": [
        {
          "type": "text",
          "text": "“Not yet.”"
        }
      ]
    },
    {
      "type": "paragraph",
      "content": [
        {
          "type": "text",
          "text": "He pulled a crumpled brown paper bag from his backpack and tossed her a bánh mì. “You’re welcome.”"
        }
      ]
    },
    {
      "type": "paragraph",
      "content": [
        {
          "type": "text",
          "text": "“You’re a saint,” she said, sitting cross-legged beside him."
        }
      ]
    },
    {
      "type": "horizontalRule"
    },
    {
      "type": "paragraph",
      "content": [
        {
          "type": "text",
          "text": "He lit a joint like it was punctuation and blew a slow cloud toward the ceiling. “So what’s the third-place article champion of the world doing tonight? Other than basking in algorithmic glory.”"
        }
      ]
    },
    {
      "type": "paragraph",
      "content": [
        {
          "type": "text",
          "text": "“Contemplating my legacy,” she muttered, taking a bite."
        }
      ]
    },
    {
      "type": "paragraph",
      "content": [
        {
          "type": "text",
          "text": "Saiesh snorted. “Your legacy is strong, dude. You’ve changed the way I see golden retrievers. Profound stuff.”"
        }
      ]
    },
    {
      "type": "paragraph",
      "content": [
        {
          "type": "text",
          "text": "She gave him a look."
        }
      ]
    },
    {
      "type": "paragraph",
      "content": [
        {
          "type": "text",
          "text": "He looked back with those big, soft-lashed eyes. The thing about Saiesh was, he’d always been the most emotionally available person in her life, and she didn’t quite know what to do with that. He’d told her once, drunk and wearing two different socks, that he’d been in love with her since the second year of college. She hadn’t said it back, but she hadn’t cut him out either."
        }
      ]
    },
    {
      "type": "paragraph",
      "content": [
        {
          "type": "text",
          "text": "Sometimes she wondered if she was keeping him in her orbit just in case. A horrible, half-cruel thought. But true."
        }
      ]
    },
    {
      "type": "horizontalRule"
    },
    {
      "type": "paragraph",
      "content": [
        {
          "type": "text",
          "text": "He passed her the joint. She declined."
        }
      ]
    },
    {
      "type": "paragraph",
      "content": [
        {
          "type": "text",
          "text": "“You ever feel like you missed your own calling?” she asked."
        }
      ]
    },
    {
      "type": "paragraph",
      "content": [
        {
          "type": "text",
          "text": "He tilted his head. “I work on AI models that predict crop yields based on climate chaos. You write about dogs. Same diff.”"
        }
      ]
    },
    {
      "type": "paragraph",
      "content": [
        {
          "type": "text",
          "text": "She threw a pillow at him."
        }
      ]
    },
    {
      "type": "paragraph",
      "content": [
        {
          "type": "text",
          "text": "But later, when he’d left and she was brushing her teeth in the dim yellow glow of her bathroom, the words echoed back. You write about dogs. A simplified truth, but not a wrong one."
        }
      ]
    },
    {
      "type": "paragraph",
      "content": [
        {
          "type": "text",
          "text": "She stared at her reflection."
        }
      ]
    },
    {
      "type": "paragraph",
      "content": [
        {
          "type": "text",
          "text": "Not ugly. Not beautiful. Smart enough. Funny when she tried. Twenty-eight, not failing—but not flying, either. Not where she thought she’d be."
        }
      ]
    },
    {
      "type": "paragraph",
      "content": [
        {
          "type": "text",
          "text": "Her reflection blinked back at her. Tired. Restless."
        }
      ]
    },
    {
      "type": "paragraph",
      "content": [
        {
          "type": "text",
          "text": "Still waiting for the story that would matter."
        }
      ]
    }
  ]
}